10/data/attachments/c4e08b64764a519f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Marissa_race_Friend_40126_3</nif:username>
            <nif:friendToBeRequested>soap_friends_335b587d-4b17-491c-beab-a5e09d5c7364</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>